/* BridgeConfViewController; first placeholder is bullet point (\u{2022}), second placeholder is bridge type "obfs4" */
"%1$@ %2$@ makes your traffic appear \"random\"." = "%1$@ Cuireann %2$@ cuma \"randamach\" ar do thrácht líonra.";

/* BridgeConfViewController; first placeholder is bullet point (\u{2022}), second placeholder is bridge type "snowflake" */
"%1$@ %2$@ makes your traffic look like a phone call to a random user on the net." = "%1$@ Cuireann %2$@ bréagriocht ar do chuid tráchta, amhail is gur chuir tú glao gutháin ar úsáideoir randamach ar an Idirlíon.";

/* BridgesConfViewController */
"Automatic Configuration" = "Automatic Configuration";

/* BridgeConfViewController */
"Bridge Configuration" = "Cumraíocht Droichid";

/* BridgeConfViewController; placeholder contains bridge type names: "meek-azure" or "obfs4" */
"Built-in %@" = "%@ ionsuite";

/* ScanQrViewController */
"Camera access was not granted or QR Code scanning is not supported by your device." = "Ní bhfuair tú cead an cód QR a scanadh, nó ní féidir leat é a dhéanamh ar do ghléas.";

/* AlertHelper */
"Cancel" = "Cealaigh";

/* MoatViewController */
"CAPTCHA Image" = "CAPTCHA Image";

/* CustomBridgesViewController */
"Copy URL to Clipboard" = "Cóipeáil an URL go dtí an Ghearrthaisce";

/* MoatViewController */
"Couldn't understand server response." = "Níor tuigeadh an freagra ón bhfreastalaí.";

/* BridgeConfViewController */
"Custom Bridges" = "Droichid Shaincheaptha";

/* Transport */
"custom bridges" = "custom bridges";

/* MoatViewController */
"Enter characters from image" = "Cuir isteach na carachtair a fheiceann tú san íomhá";

/* AlertHelper */
"Error" = "Earráid";

/* BridgesConfViewController */
"I'm sure I cannot connect without a bridge." = "I'm sure I cannot connect without a bridge.";

/* BridgeConfViewController */
"If one type of bridge does not work, try using a different one." = "Mura n-éiríonn tú le droichead amháin, bain triail as ceann difriúil.";

/* BridgeConfViewController */
"If you are in a country or using a connection that censors Tor, you might need to use bridges." = "Má tá tú lonnaithe i dtír nó ag baint úsáide as ceangal a dhéanann cinsireacht ar Tor, seans gur gá duit droichead a úsáid.";

/* CustomBridgesViewController; placeholder contains "https://bridges.torproject.org/", please visit that page and copy texts for your language! */
"In a separate browser, visit %@ and tap \"Get Bridges\" > \"Just Give Me Bridges!\"" = "I mbrabhsálaí eile, tabhair cuairt ar %@ agus tapáil \"Faigh Droichid\" > \"Ní theastaíonn uaim ach droichid!\"";

/* BridgesConfViewController */
"Manual Configuration" = "Manual Configuration";

/* BridgeConfViewController */
"No Bridges" = "Gan Droichead";

/* ApiError, placeholder is a non-success status from the server. */
"No success, but \"%@\" instead." = "Tharla earráid: %@";

/* ApiError */
"No valid HTTP response." = "Ní bhfuarthas freagra bailí HTTP.";

/* Transport */
"Obfs4 bridges" = "Obfs4 bridges";

/* AlertHelper */
"OK" = "OK";

/* CustomBridgesViewController */
"Other" = "Eile";

/* CustomBridgesViewController */
"Paste Bridges" = "Greamaigh Droichid";

/* CustomBridgesViewController; placeholder is "" "https://bridges.torproject.org/" */
"QR Code could not be decoded! Are you sure you scanned a QR code from %@?" = "Níorbh fhéidir an cód QR a dhíchódú! An bhfuil tú cinnte go bhfuair tú ó %@ é?";

/* MoatViewController */
"Request Bridges" = "Iarr Droichid";

/* BridgeConfViewController */
"Request Bridges from torproject.org" = "Iarr Droichid ó torproject.org";

/* ApiError */
"Request could not be formed. Please check host and username/password!" = "Theip orainn an t-iarratas a chruthú. Deimhnigh an t-óstainm, an t-ainm úsáideora, agus an focal faire!";

/* CustomBridgesViewController */
"Request via E-Mail" = "Iarr trí Ríomhphost";

/* CustomBridgesViewController */
"Request via Telegram" = "Request via Telegram";

/* ApiError */
"Response body missing." = "Corp an fhreagra ar iarraidh.";

/* BridgesConfViewController+Shared */
"Save" = "Save";

/* CustomBridgesViewController, ScanQrViewController */
"Scan QR Code" = "Scan Cód QR";

/* Transport */
"Snowflake bridges" = "Snowflake bridges";

/* Transport */
"Snowflake bridges (AMP rendezvous)" = "Snowflake bridges (AMP rendezvous)";

/* MoatViewController */
"Solve the CAPTCHA to request bridges." = "Freagair an CAPTCHA chun droichead a iarraidh.";

/* BridgesConfViewController */
"Try Auto-Configuration" = "Try Auto-Configuration";

/* CustomBridgesViewController */
"Upload QR Code" = "Uaslódáil Cód QR";

/* CustomBridgesViewController */
"Use Custom Bridges" = "Úsáid Droichid Shaincheaptha";

/* CustomBridgesViewController */
"Use QR Code" = "Úsáid Cód QR";
